ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_fsmc.cpp
/**
  ******************************************************************************
  * @file    stm32f10x_fsmc.c
  * @author  MCD Application Team
  * @version V3.5.0
  * @date    11-March-2011
  * @brief   This file provides all the FSMC firmware functions.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_rcc.h"
#include "stm32f10x_fsmc.h"
uint16_t FSMC::ObjectNum = 0;
/** @addtogroup STM32F10x_StdPeriph_Driver
  * @{
  */

/** @defgroup FSMC
  * @brief FSMC driver modules
  * @{
  */

/** @defgroup FSMC_Private_TypesDefinitions
  * @{
  */
/**
  * @}
  */

/** @defgroup FSMC_Private_Defines
  * @{
  */

/* --------------------- FSMC registers bit mask ---------------------------- */

/* FSMC BCRx Mask */
#define BCR_MBKEN_Set                       ((uint32_t)0x00000001)
#define BCR_MBKEN_Reset                     ((uint32_t)0x000FFFFE)
#define BCR_FACCEN_Set                      ((uint32_t)0x00000040)

/* FSMC PCRx Mask */
#define PCR_PBKEN_Set                       ((uint32_t)0x00000004)
#define PCR_PBKEN_Reset                     ((uint32_t)0x000FFFFB)
#define PCR_ECCEN_Set                       ((uint32_t)0x00000040)
#define PCR_ECCEN_Reset                     ((uint32_t)0x000FFFBF)
#define PCR_MemoryType_NAND                 ((uint32_t)0x00000008)
/**
  * @}
  */

/** @defgroup FSMC_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup FSMC_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup FSMC_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup FSMC_Private_Functions
  * @{
  */
FSMC::FSMC(uint32_t _FSMC_Bank):FSMC_Bank(_FSMC_Bank)
{
	ObjectNum++;
	RCC::ClockCmd(*this, ENABLE);
}
FSMC::FSMC(const FSMC& Other)
{
	ObjectNum++;
	this->FSMC_Bank = Other.FSMC_Bank;
}

uint32_t FSMC::GetMemoryBank(void)
{
	return FSMC_Bank;
}

FSMC::~FSMC()
{
	if(--ObjectNum==0)
		RCC::ClockCmd(*this, DISABLE);
}

/**
                  * @brief  Deinitializes the FSMC NOR/SRAM Banks registers to their default
                  *         reset values.
                  * @param  FSMC_Bank: specifies the FSMC Bank to be used
                  *   This parameter can be one of the following values:
                  *     @arg FSMC_Bank1_NORSRAM1: FSMC Bank1 NOR/SRAM1
                  *     @arg FSMC_Bank1_NORSRAM2: FSMC Bank1 NOR/SRAM2
                  *     @arg FSMC_Bank1_NORSRAM3: FSMC Bank1 NOR/SRAM3
                  *     @arg FSMC_Bank1_NORSRAM4: FSMC Bank1 NOR/SRAM4
                  * @retval None
                  */
void FSMC::NORSRAMDeInit()
{
	/* Check the parameter */
	assert_param(IS_FSMC_NORSRAM_BANK(FSMC_Bank));

	/* FSMC_Bank1_NORSRAM1 */
	if(FSMC_Bank == FSMC_Bank1_NORSRAM1)
	{
		FSMC_Bank1->BTCR[FSMC_Bank] = 0x000030DB;
	}
	/* FSMC_Bank1_NORSRAM2,  FSMC_Bank1_NORSRAM3 or FSMC_Bank1_NORSRAM4 */
	else
	{
		FSMC_Bank1->BTCR[FSMC_Bank] = 0x000030D2;
	}
	FSMC_Bank1->BTCR[FSMC_Bank + 1] = 0x0FFFFFFF;
	FSMC_Bank1E->BWTR[FSMC_Bank] = 0x0FFFFFFF;
}

/**
  * @brief  Deinitializes the FSMC NAND Banks registers to their default reset values.
  * @param  FSMC_Bank: specifies the FSMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg FSMC_Bank2_NAND: FSMC Bank2 NAND
  *     @arg FSMC_Bank3_NAND: FSMC Bank3 NAND
  * @retval None
  */
void FSMC::NANDDeInit()
{
	/* Check the parameter */
	assert_param(IS_FSMC_NAND_BANK(FSMC_Bank));

	if(FSMC_Bank == FSMC_Bank2_NAND)
	{
		/* Set the FSMC_Bank2 registers to their reset values */
		FSMC_Bank2->PCR2 = 0x00000018;
		FSMC_Bank2->SR2 = 0x00000040;
		FSMC_Bank2->PMEM2 = 0xFCFCFCFC;
		FSMC_Bank2->PATT2 = 0xFCFCFCFC;
	}
	/* FSMC_Bank3_NAND */
	else
	{
		/* Set the FSMC_Bank3 registers to their reset values */
		FSMC_Bank3->PCR3 = 0x00000018;
		FSMC_Bank3->SR3 = 0x00000040;
		FSMC_Bank3->PMEM3 = 0xFCFCFCFC;
		FSMC_Bank3->PATT3 = 0xFCFCFCFC;
	}
}

/**
  * @brief  Deinitializes the FSMC PCCARD Bank registers to their default reset values.
  * @param  None
  * @retval None
  */
void FSMC::PCCARDDeInit(void)
{
	/* Set the FSMC_Bank4 registers to their reset values */
	FSMC_Bank4->PCR4 = 0x00000018;
	FSMC_Bank4->SR4 = 0x00000000;
	FSMC_Bank4->PMEM4 = 0xFCFCFCFC;
	FSMC_Bank4->PATT4 = 0xFCFCFCFC;
	FSMC_Bank4->PIO4 = 0xFCFCFCFC;
}

/**
  * @brief  Initializes the FSMC NOR/SRAM Banks according to the specified
  *         parameters in the FSMC_NORSRAMInitStruct.
  * @param  FSMC_NORSRAMInitStruct : pointer to a FSMC_NORSRAMInitTypeDef
  *         structure that contains the configuration information for
  *        the FSMC NOR/SRAM specified Banks.
  * @retval None
  */
void FSMC::NORSRAMInit(_FSMC_NORSRAMInitTypeDef& FSMC_NORSRAMInitStruct)
{
	/* Check the parameters */
	assert_param(IS_FSMC_NORSRAM_BANK(FSMC_NORSRAMInitStruct.FSMC_Bank));
	assert_param(IS_FSMC_MUX(FSMC_NORSRAMInitStruct.FSMC_DataAddressMux));
	assert_param(IS_FSMC_MEMORY(FSMC_NORSRAMInitStruct.FSMC_MemoryType));
	assert_param(IS_FSMC_MEMORY_WIDTH(FSMC_NORSRAMInitStruct.FSMC_MemoryDataWidth));
	assert_param(IS_FSMC_BURSTMODE(FSMC_NORSRAMInitStruct.FSMC_BurstAccessMode));
	assert_param(IS_FSMC_ASYNWAIT(FSMC_NORSRAMInitStruct.FSMC_AsynchronousWait));
	assert_param(IS_FSMC_WAIT_POLARITY(FSMC_NORSRAMInitStruct.FSMC_WaitSignalPolarity));
	assert_param(IS_FSMC_WRAP_MODE(FSMC_NORSRAMInitStruct.FSMC_WrapMode));
	assert_param(IS_FSMC_WAIT_SIGNAL_ACTIVE(FSMC_NORSRAMInitStruct.FSMC_WaitSignalActive));
	assert_param(IS_FSMC_WRITE_OPERATION(FSMC_NORSRAMInitStruct.FSMC_WriteOperation));
	assert_param(IS_FSMC_WAITE_SIGNAL(FSMC_NORSRAMInitStruct.FSMC_WaitSignal));
	assert_param(IS_FSMC_EXTENDED_MODE(FSMC_NORSRAMInitStruct.FSMC_ExtendedMode));
	assert_param(IS_FSMC_WRITE_BURST(FSMC_NORSRAMInitStruct.FSMC_WriteBurst));
	assert_param(IS_FSMC_ADDRESS_SETUP_TIME(FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_AddressSetupTime));
	assert_param(IS_FSMC_ADDRESS_HOLD_TIME(FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_AddressHoldTime));
	assert_param(IS_FSMC_DATASETUP_TIME(FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_DataSetupTime));
	assert_param(IS_FSMC_TURNAROUND_TIME(FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_BusTurnAroundDuration));
	assert_param(IS_FSMC_CLK_DIV(FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_CLKDivision));
	assert_param(IS_FSMC_DATA_LATENCY(FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_DataLatency));
	assert_param(IS_FSMC_ACCESS_MODE(FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_AccessMode));

	/* Bank1 NOR/SRAM control register configuration */
	FSMC_Bank1->BTCR[FSMC_NORSRAMInitStruct.FSMC_Bank] =
	    (uint32_t)FSMC_NORSRAMInitStruct.FSMC_DataAddressMux |
	    FSMC_NORSRAMInitStruct.FSMC_MemoryType |
	    FSMC_NORSRAMInitStruct.FSMC_MemoryDataWidth |
	    FSMC_NORSRAMInitStruct.FSMC_BurstAccessMode |
	    FSMC_NORSRAMInitStruct.FSMC_AsynchronousWait |
	    FSMC_NORSRAMInitStruct.FSMC_WaitSignalPolarity |
	    FSMC_NORSRAMInitStruct.FSMC_WrapMode |
	    FSMC_NORSRAMInitStruct.FSMC_WaitSignalActive |
	    FSMC_NORSRAMInitStruct.FSMC_WriteOperation |
	    FSMC_NORSRAMInitStruct.FSMC_WaitSignal |
	    FSMC_NORSRAMInitStruct.FSMC_ExtendedMode |
	    FSMC_NORSRAMInitStruct.FSMC_WriteBurst;

