ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_fsmc.cpp
	if(FSMC_NORSRAMInitStruct.FSMC_MemoryType == FSMC_MemoryType_NOR)
	{
		FSMC_Bank1->BTCR[FSMC_NORSRAMInitStruct.FSMC_Bank] |= (uint32_t)BCR_FACCEN_Set;
	}

	/* Bank1 NOR/SRAM timing register configuration */
	FSMC_Bank1->BTCR[FSMC_NORSRAMInitStruct.FSMC_Bank + 1] =
	    (uint32_t)FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_AddressSetupTime |
	    (FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_AddressHoldTime << 4) |
	    (FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_DataSetupTime << 8) |
	    (FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_BusTurnAroundDuration << 16) |
	    (FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_CLKDivision << 20) |
	    (FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_DataLatency << 24) |
	    FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_AccessMode;


	/* Bank1 NOR/SRAM timing register for write configuration, if extended mode is used */
	if(FSMC_NORSRAMInitStruct.FSMC_ExtendedMode == FSMC_ExtendedMode_Enable)
	{
		assert_param(IS_FSMC_ADDRESS_SETUP_TIME(FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_AddressSetupTime));
		assert_param(IS_FSMC_ADDRESS_HOLD_TIME(FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_AddressHoldTime));
		assert_param(IS_FSMC_DATASETUP_TIME(FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_DataSetupTime));
		assert_param(IS_FSMC_CLK_DIV(FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_CLKDivision));
		assert_param(IS_FSMC_DATA_LATENCY(FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_DataLatency));
		assert_param(IS_FSMC_ACCESS_MODE(FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_AccessMode));
		FSMC_Bank1E->BWTR[FSMC_NORSRAMInitStruct.FSMC_Bank] =
		    (uint32_t)FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_AddressSetupTime |
		    (FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_AddressHoldTime << 4) |
		    (FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_DataSetupTime << 8) |
		    (FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_CLKDivision << 20) |
		    (FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_DataLatency << 24) |
		    FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_AccessMode;
	}
	else
	{
		FSMC_Bank1E->BWTR[FSMC_NORSRAMInitStruct.FSMC_Bank] = 0x0FFFFFFF;
	}
}

/**
  * @brief  Initializes the FSMC NAND Banks according to the specified
  *         parameters in the FSMC_NANDInitStruct.
  * @param  FSMC_NANDInitStruct : pointer to a FSMC_NANDInitTypeDef
  *         structure that contains the configuration information for the FSMC
  *         NAND specified Banks.
  * @retval None
  */
void FSMC::NANDInit(_FSMC_NANDInitTypeDef& FSMC_NANDInitStruct)
{
	uint32_t tmppcr = 0x00000000, tmppmem = 0x00000000, tmppatt = 0x00000000;

	/* Check the parameters */
	assert_param(IS_FSMC_NAND_BANK(FSMC_NANDInitStruct.FSMC_Bank));
	assert_param(IS_FSMC_WAIT_FEATURE(FSMC_NANDInitStruct.FSMC_Waitfeature));
	assert_param(IS_FSMC_MEMORY_WIDTH(FSMC_NANDInitStruct.FSMC_MemoryDataWidth));
	assert_param(IS_FSMC_ECC_STATE(FSMC_NANDInitStruct.FSMC_ECC));
	assert_param(IS_FSMC_ECCPAGE_SIZE(FSMC_NANDInitStruct.FSMC_ECCPageSize));
	assert_param(IS_FSMC_TCLR_TIME(FSMC_NANDInitStruct.FSMC_TCLRSetupTime));
	assert_param(IS_FSMC_TAR_TIME(FSMC_NANDInitStruct.FSMC_TARSetupTime));
	assert_param(IS_FSMC_SETUP_TIME(FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_SetupTime));
	assert_param(IS_FSMC_WAIT_TIME(FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_WaitSetupTime));
	assert_param(IS_FSMC_HOLD_TIME(FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HoldSetupTime));
	assert_param(IS_FSMC_HIZ_TIME(FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HiZSetupTime));
	assert_param(IS_FSMC_SETUP_TIME(FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_SetupTime));
	assert_param(IS_FSMC_WAIT_TIME(FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_WaitSetupTime));
	assert_param(IS_FSMC_HOLD_TIME(FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HoldSetupTime));
	assert_param(IS_FSMC_HIZ_TIME(FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HiZSetupTime));

	/* Set the tmppcr value according to FSMC_NANDInitStruct parameters */
	tmppcr = (uint32_t)FSMC_NANDInitStruct.FSMC_Waitfeature |
	         PCR_MemoryType_NAND |
	         FSMC_NANDInitStruct.FSMC_MemoryDataWidth |
	         FSMC_NANDInitStruct.FSMC_ECC |
	         FSMC_NANDInitStruct.FSMC_ECCPageSize |
	         (FSMC_NANDInitStruct.FSMC_TCLRSetupTime << 9) |
	         (FSMC_NANDInitStruct.FSMC_TARSetupTime << 13);

	/* Set tmppmem value according to FSMC_CommonSpaceTimingStructure parameters */
	tmppmem = (uint32_t)FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_SetupTime |
	          (FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_WaitSetupTime << 8) |
	          (FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HoldSetupTime << 16) |
	          (FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HiZSetupTime << 24);

	/* Set tmppatt value according to FSMC_AttributeSpaceTimingStructure parameters */
	tmppatt = (uint32_t)FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_SetupTime |
	          (FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_WaitSetupTime << 8) |
	          (FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HoldSetupTime << 16) |
	          (FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HiZSetupTime << 24);

	if(FSMC_NANDInitStruct.FSMC_Bank == FSMC_Bank2_NAND)
	{
		/* FSMC_Bank2_NAND registers configuration */
		FSMC_Bank2->PCR2 = tmppcr;
		FSMC_Bank2->PMEM2 = tmppmem;
		FSMC_Bank2->PATT2 = tmppatt;
	}
	else
	{
		/* FSMC_Bank3_NAND registers configuration */
		FSMC_Bank3->PCR3 = tmppcr;
		FSMC_Bank3->PMEM3 = tmppmem;
		FSMC_Bank3->PATT3 = tmppatt;
	}
}

/**
  * @brief  Initializes the FSMC PCCARD Bank according to the specified
  *         parameters in the FSMC_PCCARDInitStruct.
  * @param  FSMC_PCCARDInitStruct : pointer to a FSMC_PCCARDInitTypeDef
  *         structure that contains the configuration information for the FSMC
  *         PCCARD Bank.
  * @retval None
  */
void FSMC::PCCARDInit(_FSMC_PCCARDInitTypeDef& FSMC_PCCARDInitStruct)
{
	/* Check the parameters */
	assert_param(IS_FSMC_WAIT_FEATURE(FSMC_PCCARDInitStruct.FSMC_Waitfeature));
	assert_param(IS_FSMC_TCLR_TIME(FSMC_PCCARDInitStruct.FSMC_TCLRSetupTime));
	assert_param(IS_FSMC_TAR_TIME(FSMC_PCCARDInitStruct.FSMC_TARSetupTime));

