ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_fsmc.cpp
	assert_param(IS_FSMC_SETUP_TIME(FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_SetupTime));
	assert_param(IS_FSMC_WAIT_TIME(FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_WaitSetupTime));
	assert_param(IS_FSMC_HOLD_TIME(FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HoldSetupTime));
	assert_param(IS_FSMC_HIZ_TIME(FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HiZSetupTime));

	assert_param(IS_FSMC_SETUP_TIME(FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_SetupTime));
	assert_param(IS_FSMC_WAIT_TIME(FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_WaitSetupTime));
	assert_param(IS_FSMC_HOLD_TIME(FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HoldSetupTime));
	assert_param(IS_FSMC_HIZ_TIME(FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HiZSetupTime));
	assert_param(IS_FSMC_SETUP_TIME(FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_SetupTime));
	assert_param(IS_FSMC_WAIT_TIME(FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_WaitSetupTime));
	assert_param(IS_FSMC_HOLD_TIME(FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_HoldSetupTime));
	assert_param(IS_FSMC_HIZ_TIME(FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_HiZSetupTime));

	/* Set the PCR4 register value according to FSMC_PCCARDInitStruct parameters */
	FSMC_Bank4->PCR4 = (uint32_t)FSMC_PCCARDInitStruct.FSMC_Waitfeature |
	                   FSMC_MemoryDataWidth_16b |
	                   (FSMC_PCCARDInitStruct.FSMC_TCLRSetupTime << 9) |
	                   (FSMC_PCCARDInitStruct.FSMC_TARSetupTime << 13);

	/* Set PMEM4 register value according to FSMC_CommonSpaceTimingStructure parameters */
	FSMC_Bank4->PMEM4 = (uint32_t)FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_SetupTime |
	                    (FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_WaitSetupTime << 8) |
	                    (FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HoldSetupTime << 16) |
	                    (FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HiZSetupTime << 24);

	/* Set PATT4 register value according to FSMC_AttributeSpaceTimingStructure parameters */
	FSMC_Bank4->PATT4 = (uint32_t)FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_SetupTime |
	                    (FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_WaitSetupTime << 8) |
	                    (FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HoldSetupTime << 16) |
	                    (FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HiZSetupTime << 24);

	/* Set PIO4 register value according to FSMC_IOSpaceTimingStructure parameters */
	FSMC_Bank4->PIO4 = (uint32_t)FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_SetupTime |
	                   (FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_WaitSetupTime << 8) |
	                   (FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_HoldSetupTime << 16) |
	                   (FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_HiZSetupTime << 24);
}

/**
  * @brief  Fills each FSMC_NORSRAMInitStruct member with its default value.
  * @param  FSMC_NORSRAMInitStruct: pointer to a FSMC_NORSRAMInitTypeDef
  *         structure which will be initialized.
  * @retval None
  */
void FSMC::NORSRAMStructInit(_FSMC_NORSRAMInitTypeDef& FSMC_NORSRAMInitStruct)
{
	/* Reset NOR/SRAM Init structure parameters values */
	FSMC_NORSRAMInitStruct.FSMC_Bank = FSMC_Bank1_NORSRAM1;
	FSMC_NORSRAMInitStruct.FSMC_DataAddressMux = FSMC_DataAddressMux_Enable;
	FSMC_NORSRAMInitStruct.FSMC_MemoryType = FSMC_MemoryType_SRAM;
	FSMC_NORSRAMInitStruct.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_8b;
	FSMC_NORSRAMInitStruct.FSMC_BurstAccessMode = FSMC_BurstAccessMode_Disable;
	FSMC_NORSRAMInitStruct.FSMC_AsynchronousWait = FSMC_AsynchronousWait_Disable;
	FSMC_NORSRAMInitStruct.FSMC_WaitSignalPolarity = FSMC_WaitSignalPolarity_Low;
	FSMC_NORSRAMInitStruct.FSMC_WrapMode = FSMC_WrapMode_Disable;
	FSMC_NORSRAMInitStruct.FSMC_WaitSignalActive = FSMC_WaitSignalActive_BeforeWaitState;
	FSMC_NORSRAMInitStruct.FSMC_WriteOperation = FSMC_WriteOperation_Enable;
	FSMC_NORSRAMInitStruct.FSMC_WaitSignal = FSMC_WaitSignal_Enable;
	FSMC_NORSRAMInitStruct.FSMC_ExtendedMode = FSMC_ExtendedMode_Disable;
	FSMC_NORSRAMInitStruct.FSMC_WriteBurst = FSMC_WriteBurst_Disable;
	FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_AddressSetupTime = 0xF;
	FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_AddressHoldTime = 0xF;
	FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_DataSetupTime = 0xFF;
	FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_BusTurnAroundDuration = 0xF;
	FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_CLKDivision = 0xF;
	FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_DataLatency = 0xF;
	FSMC_NORSRAMInitStruct.FSMC_ReadWriteTimingStruct->FSMC_AccessMode = FSMC_AccessMode_A;
	FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_AddressSetupTime = 0xF;
	FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_AddressHoldTime = 0xF;
	FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_DataSetupTime = 0xFF;
	FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_BusTurnAroundDuration = 0xF;
	FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_CLKDivision = 0xF;
	FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_DataLatency = 0xF;
	FSMC_NORSRAMInitStruct.FSMC_WriteTimingStruct->FSMC_AccessMode = FSMC_AccessMode_A;
}

/**
  * @brief  Fills each FSMC_NANDInitStruct member with its default value.
  * @param  FSMC_NANDInitStruct: pointer to a FSMC_NANDInitTypeDef
  *         structure which will be initialized.
  * @retval None
  */
void FSMC::NANDStructInit(_FSMC_NANDInitTypeDef& FSMC_NANDInitStruct)
{
	/* Reset NAND Init structure parameters values */
	FSMC_NANDInitStruct.FSMC_Bank = FSMC_Bank2_NAND;
	FSMC_NANDInitStruct.FSMC_Waitfeature = FSMC_Waitfeature_Disable;
	FSMC_NANDInitStruct.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_8b;
	FSMC_NANDInitStruct.FSMC_ECC = FSMC_ECC_Disable;
	FSMC_NANDInitStruct.FSMC_ECCPageSize = FSMC_ECCPageSize_256Bytes;
	FSMC_NANDInitStruct.FSMC_TCLRSetupTime = 0x0;
	FSMC_NANDInitStruct.FSMC_TARSetupTime = 0x0;
	FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_SetupTime = 0xFC;
	FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_WaitSetupTime = 0xFC;
	FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HoldSetupTime = 0xFC;
	FSMC_NANDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HiZSetupTime = 0xFC;
	FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_SetupTime = 0xFC;
	FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_WaitSetupTime = 0xFC;
	FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HoldSetupTime = 0xFC;
	FSMC_NANDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HiZSetupTime = 0xFC;
}

/**
  * @brief  Fills each FSMC_PCCARDInitStruct member with its default value.
  * @param  FSMC_PCCARDInitStruct: pointer to a FSMC_PCCARDInitTypeDef
  *         structure which will be initialized.
  * @retval None
  */
void FSMC::PCCARDStructInit(_FSMC_PCCARDInitTypeDef& FSMC_PCCARDInitStruct)
{
	/* Reset PCCARD Init structure parameters values */
	FSMC_PCCARDInitStruct.FSMC_Waitfeature = FSMC_Waitfeature_Disable;
	FSMC_PCCARDInitStruct.FSMC_TCLRSetupTime = 0x0;
	FSMC_PCCARDInitStruct.FSMC_TARSetupTime = 0x0;
	FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_SetupTime = 0xFC;
	FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_WaitSetupTime = 0xFC;
	FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HoldSetupTime = 0xFC;
	FSMC_PCCARDInitStruct.FSMC_CommonSpaceTimingStruct->FSMC_HiZSetupTime = 0xFC;
	FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_SetupTime = 0xFC;
	FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_WaitSetupTime = 0xFC;
	FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HoldSetupTime = 0xFC;
	FSMC_PCCARDInitStruct.FSMC_AttributeSpaceTimingStruct->FSMC_HiZSetupTime = 0xFC;
	FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_SetupTime = 0xFC;
	FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_WaitSetupTime = 0xFC;
	FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_HoldSetupTime = 0xFC;
	FSMC_PCCARDInitStruct.FSMC_IOSpaceTimingStruct->FSMC_HiZSetupTime = 0xFC;
}

/**
  * @brief  Enables or disables the specified NOR/SRAM Memory Bank.
  * @param  FSMC_Bank: specifies the FSMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg FSMC_Bank1_NORSRAM1: FSMC Bank1 NOR/SRAM1
  *     @arg FSMC_Bank1_NORSRAM2: FSMC Bank1 NOR/SRAM2
  *     @arg FSMC_Bank1_NORSRAM3: FSMC Bank1 NOR/SRAM3
  *     @arg FSMC_Bank1_NORSRAM4: FSMC Bank1 NOR/SRAM4
  * @param  NewState: new state of the FSMC_Bank. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void FSMC::NORSRAMCmd(FunctionalState NewState)
{
	assert_param(IS_FSMC_NORSRAM_BANK(FSMC_Bank));
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	if(NewState != DISABLE)
	{
		/* Enable the selected NOR/SRAM Bank by setting the PBKEN bit in the BCRx register */
		FSMC_Bank1->BTCR[FSMC_Bank] |= BCR_MBKEN_Set;
	}
	else
	{
		/* Disable the selected NOR/SRAM Bank by clearing the PBKEN bit in the BCRx register */
		FSMC_Bank1->BTCR[FSMC_Bank] &= BCR_MBKEN_Reset;
	}
}

/**
  * @brief  Enables or disables the specified NAND Memory Bank.
  * @param  FSMC_Bank: specifies the FSMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg FSMC_Bank2_NAND: FSMC Bank2 NAND
  *     @arg FSMC_Bank3_NAND: FSMC Bank3 NAND
  * @param  NewState: new state of the FSMC_Bank. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void FSMC::NANDCmd(FunctionalState NewState)
{
	assert_param(IS_FSMC_NAND_BANK(FSMC_Bank));
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	if(NewState != DISABLE)
	{
		/* Enable the selected NAND Bank by setting the PBKEN bit in the PCRx register */
		if(FSMC_Bank == FSMC_Bank2_NAND)
		{
			FSMC_Bank2->PCR2 |= PCR_PBKEN_Set;
		}
		else
		{
			FSMC_Bank3->PCR3 |= PCR_PBKEN_Set;
		}
	}
	else
	{
		/* Disable the selected NAND Bank by clearing the PBKEN bit in the PCRx register */
		if(FSMC_Bank == FSMC_Bank2_NAND)
		{
			FSMC_Bank2->PCR2 &= PCR_PBKEN_Reset;
		}
		else
		{
			FSMC_Bank3->PCR3 &= PCR_PBKEN_Reset;
		}
	}
}

/**
  * @brief  Enables or disables the PCCARD Memory Bank.
  * @param  NewState: new state of the PCCARD Memory Bank.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void FSMC::PCCARDCmd(FunctionalState NewState)
{
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	if(NewState != DISABLE)
	{
		/* Enable the PCCARD Bank by setting the PBKEN bit in the PCR4 register */
		FSMC_Bank4->PCR4 |= PCR_PBKEN_Set;
	}
	else
	{
		/* Disable the PCCARD Bank by clearing the PBKEN bit in the PCR4 register */
		FSMC_Bank4->PCR4 &= PCR_PBKEN_Reset;
	}
}

/**
  * @brief  Enables or disables the FSMC NAND ECC feature.
  * @param  FSMC_Bank: specifies the FSMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg FSMC_Bank2_NAND: FSMC Bank2 NAND
  *     @arg FSMC_Bank3_NAND: FSMC Bank3 NAND
  * @param  NewState: new state of the FSMC NAND ECC feature.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void FSMC::NANDECCCmd(FunctionalState NewState)
{
	assert_param(IS_FSMC_NAND_BANK(FSMC_Bank));
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	if(NewState != DISABLE)
	{
		/* Enable the selected NAND Bank ECC function by setting the ECCEN bit in the PCRx register */
		if(FSMC_Bank == FSMC_Bank2_NAND)
		{
			FSMC_Bank2->PCR2 |= PCR_ECCEN_Set;
		}
		else
		{
			FSMC_Bank3->PCR3 |= PCR_ECCEN_Set;
		}
	}
	else
	{
		/* Disable the selected NAND Bank ECC function by clearing the ECCEN bit in the PCRx register */
		if(FSMC_Bank == FSMC_Bank2_NAND)
		{
			FSMC_Bank2->PCR2 &= PCR_ECCEN_Reset;
		}
		else
		{
			FSMC_Bank3->PCR3 &= PCR_ECCEN_Reset;
		}
	}
}

/**
  * @brief  Returns the error correction code register value.
  * @param  FSMC_Bank: specifies the FSMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg FSMC_Bank2_NAND: FSMC Bank2 NAND
  *     @arg FSMC_Bank3_NAND: FSMC Bank3 NAND
  * @retval The Error Correction Code (ECC) value.
  */
uint32_t FSMC::GetECC()
{
	uint32_t eccval = 0x00000000;

	if(FSMC_Bank == FSMC_Bank2_NAND)
	{
		/* Get the ECCR2 register value */
		eccval = FSMC_Bank2->ECCR2;
	}
	else
	{
		/* Get the ECCR3 register value */
		eccval = FSMC_Bank3->ECCR3;
	}
	/* Return the error correction code value */
	return(eccval);
}

/**
  * @brief  Enables or disables the specified FSMC interrupts.
  * @param  FSMC_Bank: specifies the FSMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg FSMC_Bank2_NAND: FSMC Bank2 NAND
  *     @arg FSMC_Bank3_NAND: FSMC Bank3 NAND
  *     @arg FSMC_Bank4_PCCARD: FSMC Bank4 PCCARD
  * @param  FSMC_IT: specifies the FSMC interrupt sources to be enabled or disabled.
  *   This parameter can be any combination of the following values:
  *     @arg FSMC_IT_RisingEdge: Rising edge detection interrupt.
  *     @arg FSMC_IT_Level: Level edge detection interrupt.
  *     @arg FSMC_IT_FallingEdge: Falling edge detection interrupt.
  * @param  NewState: new state of the specified FSMC interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void FSMC::ITConfig(uint32_t FSMC_IT, FunctionalState NewState)
{
	assert_param(IS_FSMC_IT_BANK(FSMC_Bank));
	assert_param(IS_FSMC_IT(FSMC_IT));
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	if(NewState != DISABLE)
	{
		/* Enable the selected FSMC_Bank2 interrupts */
		if(FSMC_Bank == FSMC_Bank2_NAND)
		{
			FSMC_Bank2->SR2 |= FSMC_IT;
		}
		/* Enable the selected FSMC_Bank3 interrupts */
		else if(FSMC_Bank == FSMC_Bank3_NAND)
		{
			FSMC_Bank3->SR3 |= FSMC_IT;
		}
		/* Enable the selected FSMC_Bank4 interrupts */
		else
		{
			FSMC_Bank4->SR4 |= FSMC_IT;
		}
	}
	else
	{
		/* Disable the selected FSMC_Bank2 interrupts */
		if(FSMC_Bank == FSMC_Bank2_NAND)
		{

			FSMC_Bank2->SR2 &= (uint32_t)~FSMC_IT;
		}
		/* Disable the selected FSMC_Bank3 interrupts */
		else if(FSMC_Bank == FSMC_Bank3_NAND)
		{
			FSMC_Bank3->SR3 &= (uint32_t)~FSMC_IT;
		}
		/* Disable the selected FSMC_Bank4 interrupts */
		else
		{
			FSMC_Bank4->SR4 &= (uint32_t)~FSMC_IT;
		}
	}
}

/**
  * @brief  Checks whether the specified FSMC flag is set or not.
  * @param  FSMC_Bank: specifies the FSMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg FSMC_Bank2_NAND: FSMC Bank2 NAND
  *     @arg FSMC_Bank3_NAND: FSMC Bank3 NAND
  *     @arg FSMC_Bank4_PCCARD: FSMC Bank4 PCCARD
  * @param  FSMC_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg FSMC_FLAG_RisingEdge: Rising egde detection Flag.
  *     @arg FSMC_FLAG_Level: Level detection Flag.
  *     @arg FSMC_FLAG_FallingEdge: Falling egde detection Flag.
  *     @arg FSMC_FLAG_FEMPT: Fifo empty Flag.
  * @retval The new state of FSMC_FLAG (SET or RESET).
  */
FlagStatus FSMC::GetFlagStatus(uint32_t FSMC_FLAG)
{
	FlagStatus bitstatus = RESET;
	uint32_t tmpsr = 0x00000000;

	/* Check the parameters */
	assert_param(IS_FSMC_GETFLAG_BANK(FSMC_Bank));
	assert_param(IS_FSMC_GET_FLAG(FSMC_FLAG));

	if(FSMC_Bank == FSMC_Bank2_NAND)
	{
		tmpsr = FSMC_Bank2->SR2;
	}
	else if(FSMC_Bank == FSMC_Bank3_NAND)
	{
		tmpsr = FSMC_Bank3->SR3;
	}
	/* FSMC_Bank4_PCCARD*/
	else
	{
		tmpsr = FSMC_Bank4->SR4;
	}

	/* Get the flag status */
	if((tmpsr & FSMC_FLAG) != (uint16_t)RESET)
	{
		bitstatus = SET;
	}
	else
	{
		bitstatus = RESET;
	}
	/* Return the flag status */
	return bitstatus;
}

/**
  * @brief  Clears the FSMC's pending flags.
  * @param  FSMC_Bank: specifies the FSMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg FSMC_Bank2_NAND: FSMC Bank2 NAND
  *     @arg FSMC_Bank3_NAND: FSMC Bank3 NAND
  *     @arg FSMC_Bank4_PCCARD: FSMC Bank4 PCCARD
  * @param  FSMC_FLAG: specifies the flag to clear.
  *   This parameter can be any combination of the following values:
  *     @arg FSMC_FLAG_RisingEdge: Rising egde detection Flag.
  *     @arg FSMC_FLAG_Level: Level detection Flag.
  *     @arg FSMC_FLAG_FallingEdge: Falling egde detection Flag.
  * @retval None
  */
void FSMC::ClearFlag(uint32_t FSMC_FLAG)
{
	/* Check the parameters */
	assert_param(IS_FSMC_GETFLAG_BANK(FSMC_Bank));
	assert_param(IS_FSMC_CLEAR_FLAG(FSMC_FLAG));

	if(FSMC_Bank == FSMC_Bank2_NAND)
	{
		FSMC_Bank2->SR2 &= ~FSMC_FLAG;
	}
	else if(FSMC_Bank == FSMC_Bank3_NAND)
	{
		FSMC_Bank3->SR3 &= ~FSMC_FLAG;
	}
	/* FSMC_Bank4_PCCARD*/
	else
	{
		FSMC_Bank4->SR4 &= ~FSMC_FLAG;
	}
}

/**
  * @brief  Checks whether the specified FSMC interrupt has occurred or not.
  * @param  FSMC_Bank: specifies the FSMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg FSMC_Bank2_NAND: FSMC Bank2 NAND
  *     @arg FSMC_Bank3_NAND: FSMC Bank3 NAND
  *     @arg FSMC_Bank4_PCCARD: FSMC Bank4 PCCARD
  * @param  FSMC_IT: specifies the FSMC interrupt source to check.
  *   This parameter can be one of the following values:
  *     @arg FSMC_IT_RisingEdge: Rising edge detection interrupt.
  *     @arg FSMC_IT_Level: Level edge detection interrupt.
  *     @arg FSMC_IT_FallingEdge: Falling edge detection interrupt.
  * @retval The new state of FSMC_IT (SET or RESET).
  */
ITStatus FSMC::GetITStatus(uint32_t FSMC_IT)
{
	ITStatus bitstatus = RESET;
	uint32_t tmpsr = 0x0, itstatus = 0x0, itenable = 0x0;

	/* Check the parameters */
	assert_param(IS_FSMC_IT_BANK(FSMC_Bank));
	assert_param(IS_FSMC_GET_IT(FSMC_IT));

	if(FSMC_Bank == FSMC_Bank2_NAND)
	{
		tmpsr = FSMC_Bank2->SR2;
	}
	else if(FSMC_Bank == FSMC_Bank3_NAND)
	{
		tmpsr = FSMC_Bank3->SR3;
	}
	/* FSMC_Bank4_PCCARD*/
	else
	{
		tmpsr = FSMC_Bank4->SR4;
	}

	itstatus = tmpsr & FSMC_IT;

	itenable = tmpsr & (FSMC_IT >> 3);
	if((itstatus != (uint32_t)RESET) && (itenable != (uint32_t)RESET))
	{
		bitstatus = SET;
	}
	else
	{
		bitstatus = RESET;
	}
	return bitstatus;
}

/**
  * @brief  Clears the FSMC's interrupt pending bits.
  * @param  FSMC_Bank: specifies the FSMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg FSMC_Bank2_NAND: FSMC Bank2 NAND
  *     @arg FSMC_Bank3_NAND: FSMC Bank3 NAND
  *     @arg FSMC_Bank4_PCCARD: FSMC Bank4 PCCARD
  * @param  FSMC_IT: specifies the interrupt pending bit to clear.
  *   This parameter can be any combination of the following values:
  *     @arg FSMC_IT_RisingEdge: Rising edge detection interrupt.
  *     @arg FSMC_IT_Level: Level edge detection interrupt.
  *     @arg FSMC_IT_FallingEdge: Falling edge detection interrupt.
  * @retval None
  */
void FSMC::ClearITPendingBit(uint32_t FSMC_IT)
{
	/* Check the parameters */
	assert_param(IS_FSMC_IT_BANK(FSMC_Bank));
	assert_param(IS_FSMC_IT(FSMC_IT));

	if(FSMC_Bank == FSMC_Bank2_NAND)
	{
		FSMC_Bank2->SR2 &= ~(FSMC_IT >> 3);
	}
	else if(FSMC_Bank == FSMC_Bank3_NAND)
	{
		FSMC_Bank3->SR3 &= ~(FSMC_IT >> 3);
	}
	/* FSMC_Bank4_PCCARD*/
	else
	{
		FSMC_Bank4->SR4 &= ~(FSMC_IT >> 3);
	}
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
